Autodesk.Revit.DB.LeaderEndCondition
An enumerated type listing Leader end conditions that are supported for IndependentTags.

Autodesk.Revit.DB.LeaderEndCondition.Free
The Leader of the tag is free.

Autodesk.Revit.DB.LeaderEndCondition.Attached
The Leader of the tag is attached.